#+title:      C Klasse 2023-27
#+date:       [2023-07-08 Sa 14:40]
#+filetags:   :1c:Project:
#+identifier: 20230708T144017
#+CATEGORY: golling

* 1c 07:45-08:35
<%%(org-class 2022 9 12 2023 7 3 1 27)>
Das ist ein Text in der Iosevka Aile. Hm einmal was anderes und gefällt mir viel besser. 

* 1c 07:45-08:35
<%%(org-class 2022 9 12 2023 7 3 1 27)>

* 1C [KV Eva Hofer]
#+Name: 2021-students
| First     | Last            | Name                 | Note | Mitarbeit | Heft | LZK |
|-----------+-----------------+----------------------+------+-----------+------+-----|
| Julia     | Anthofer        | [[Julia Anthofer][Julia Anthofer]]       |    1 |           |      |     |
| Hanna     | Bernhofer       | [[Hanna Bernhofer][Hanna Bernhofer]]      |    1 |           |      |     |
| Simon     | Hager           | [[Simon Hager][Simon Hager]]          |    1 |           |      |     |
| Ema       | Ljubic          | [[Ema Ljubic][Ema Ljubic]]           |    1 |           |      |     |
| Mira      | Meßner          | [[Mira Meßner][Mira Meßner]]          |    1 |           |      |     |
| Benjamin  | Neureiter       | [[Benjamin Neureiter][Benjamin Neureiter]]   |    1 |           |      |     |
| Paula     | Neureiter       | [[Paula Neureiter][Paula Neureiter]]      |    1 |           |      |     |
| Sebastian | Neureiter       | [[Sebastian Neureiter][Sebastian Neureiter]]  |    1 |           |      |     |
| Julia     | Rettenbacher    | [[Julia Rettenbacher][Julia Rettenbacher]]   |    1 |           |      |     |
| Sophie    | Schieferer      | [[Sophie Schieferer][Sophie Schieferer]]    |    1 |           |      |     |
| Luca      | Steiner         | [[Luca Steiner][Luca Steiner]]         |    1 |           |      |     |
| Pia       | Stoß            | [[Pia Stoß][Pia Stoß]]             |    1 |           |      |     |
| Lara      | Struber-Steiner | [[Lara Struber-Steiner][Lara Struber-Steiner]] |    1 |           |      |     |
| Manuel    | Tikvic          | [[Manuel Tikvic][Manuel Tikvic]]        |    1 |           |      |     |
| Valentina | Tillian         | [[Valentina Tillian][Valentina Tillian]]    |      |           |      |     |
| Valentin  | Walcher         | [[Valentin Walcher][Valentin Walcher]]     |    1 |           |      |     |
| Vincent   | Walcher         | [[Vincent Walcher][Vincent Walcher]]      |      |           |      |     |
| Jasmin    | Zuchristian     | [[Jasmin Zuchristian][Jasmin Zuchristian]]   |      |           |      |     |
|-----------+-----------------+----------------------+------+-----------+------+-----|
#+TBLFM: $4=vmean($5..$>)
#+TBLFM: $3='(concat "[[" $1 " " $2 "][" $1 " " $2 "]]")
#+TBLFM: $5='(identity remote(2021-22-Mitarbeit,@@#$2))

#+BEGIN_SRC python :var table=2021-students :results output raw
  print('* Mitarbeit')
  for student in table:
      first = student[0]
      last = student[1]
      email = first + '.' + last + '@golling.schule'
      print('** ' + first + ' ' + last + '')
      print(':PROPERTIES:')
      print(':EMAIL: ' '[[mailto: ' + first + ' ' + last + ' <' + email + '>]]')
      print(':END: ')
      print('\n\n')
#+END_SRC

#+RESULTS:
* Mitarbeit

#+Name: Mitarbeit
| Name                 | Note | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 | 10 |
|----------------------+------+---+---+---+---+---+---+---+---+---+----|
| [[Julia Anthofer][Julia Anthofer]]       |      |   |   |   |   |   |   |   |   |   |    |
| [[Hanna Bernhofer][Hanna Bernhofer]]      |      |   |   |   |   |   |   |   |   |   |    |
| [[Simon Hager][Simon Hager]]          |      |   |   |   |   |   |   |   |   |   |    |
| [[Ema Ljubic][Ema Ljubic]]           |      |   |   |   |   |   |   |   |   |   |    |
| [[Mira Meßner][Mira Meßner]]          |      |   |   |   |   |   |   |   |   |   |    |
| [[Benjamin Neureiter][Benjamin Neureiter]]   |      |   |   |   |   |   |   |   |   |   |    |
| [[Paula Neureiter][Paula Neureiter]]      |      |   |   |   |   |   |   |   |   |   |    |
| [[Sebastian Neureiter][Sebastian Neureiter]]  |      |   |   |   |   |   |   |   |   |   |    |
| [[Julia Rettenbacher][Julia Rettenbacher]]   |      |   |   |   |   |   |   |   |   |   |    |
| [[Sophie Schieferer][Sophie Schieferer]]    |      |   |   |   |   |   |   |   |   |   |    |
| [[Luca Steiner][Luca Steiner]]         |      |   |   |   |   |   |   |   |   |   |    |
| [[Pia Stoß][Pia Stoß]]             |      |   |   |   |   |   |   |   |   |   |    |
| [[Lara Struber-Steiner][Lara Struber-Steiner]] |      |   |   |   |   |   |   |   |   |   |    |
| [[Manuel Tikvic][Manuel Tikvic]]        |      |   |   |   |   |   |   |   |   |   |    |
| [[Valentina Tillian][Valentina Tillian]]    |      |   |   |   |   |   |   |   |   |   |    |
| [[Valentin Walcher][Valentin Walcher]]     |      |   |   |   |   |   |   |   |   |   |    |
| [[Vincent Walcher][Vincent Walcher]]      |      |   |   |   |   |   |   |   |   |   |    |
| [[Jasmin Zuchristian][Jasmin Zuchristian]]   |      |   |   |   |   |   |   |   |   |   |    |
#+TBLFM: $2=vmean($3..$>)
#+TBLFM: $1='(identity remote(2021-students,@@#$3))



** Julia Anthofer
:PROPERTIES:
:EMAIL: [[mailto: Julia Anthofer <Julia.Anthofer@golling.schule>]]
:END: 



** Hanna Bernhofer
:PROPERTIES:
:EMAIL: [[mailto: Hanna Bernhofer <Hanna.Bernhofer@golling.schule>]]
:END: 



** Simon Hager
:PROPERTIES:
:EMAIL: [[mailto: Simon Hager <Simon.Hager@golling.schule>]]
:END: 



** Ema Ljubic
:PROPERTIES:
:EMAIL: [[mailto: Ema Ljubic <Ema.Ljubic@golling.schule>]]
:END: 



** Mira Meßner
:PROPERTIES:
:EMAIL: [[mailto: Mira Meßner <Mira.Meßner@golling.schule>]]
:END: 



** Benjamin Neureiter
:PROPERTIES:
:EMAIL: [[mailto: Benjamin Neureiter <Benjamin.Neureiter@golling.schule>]]
:END: 



** Paula Neureiter
:PROPERTIES:
:EMAIL: [[mailto: Paula Neureiter <Paula.Neureiter@golling.schule>]]
:END: 



** Sebastian Neureiter
:PROPERTIES:
:EMAIL: [[mailto: Sebastian Neureiter <Sebastian.Neureiter@golling.schule>]]
:END: 



** Julia Rettenbacher
:PROPERTIES:
:EMAIL: [[mailto: Julia Rettenbacher <Julia.Rettenbacher@golling.schule>]]
:END: 



** Sophie Schieferer
:PROPERTIES:
:EMAIL: [[mailto: Sophie Schieferer <Sophie.Schieferer@golling.schule>]]
:END: 



** Luca Steiner
:PROPERTIES:
:EMAIL: [[mailto: Luca Steiner <Luca.Steiner@golling.schule>]]
:END: 



** Pia Stoß
:PROPERTIES:
:EMAIL: [[mailto: Pia Stoß <Pia.Stoß@golling.schule>]]
:END: 



** Lara Struber-Steiner
:PROPERTIES:
:EMAIL: [[mailto: Lara Struber-Steiner <Lara.Struber-Steiner@golling.schule>]]
:END: 



** Manuel Tikvic
:PROPERTIES:
:EMAIL: [[mailto: Manuel Tikvic <Manuel.Tikvic@golling.schule>]]
:END: 



** Valentina Tillian
:PROPERTIES:
:EMAIL: [[mailto: Valentina Tillian <Valentina.Tillian@golling.schule>]]
:END: 



** Valentin Walcher
:PROPERTIES:
:EMAIL: [[mailto: Valentin Walcher <Valentin.Walcher@golling.schule>]]
:END: 



** Vincent Walcher
:PROPERTIES:
:EMAIL: [[mailto: Vincent Walcher <Vincent.Walcher@golling.schule>]]
:END: 



** Jasmin Zuchristian
:PROPERTIES:
:EMAIL: [[mailto: Jasmin Zuchristian <Jasmin.Zuchristian@golling.schule>]]
:END: 





* Reflexionen

